srw-soap-searchRetrieve-request-koira.xml

<?xml version="1.0" encoding="utf-8"?>
<soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
	<soap12:Body>
		<searchRetrieveRequest xmlns="http://www.loc.gov/zing/srw/">
			<query>koira</query>
			<maximumRecords>2</maximumRecords>
			<recordSchema>marcxml</recordSchema>
		</searchRetrieveRequest>
	</soap12:Body>
</soap12:Envelope>
